; domain
(define
	(domain mary)
	(:requirements :adl)
	(:predicates
	    (pomieszczenie ?litera)
	    (kolorx ?kolor)
	    (ludek ?gdzie)
	    (kolor ?jaki ?gdzie ?nr)
	    (sasiaduje ?pom1 ?pom2 ?kolor)
	    (mam ?kolor ?nr)
	    (numer ?nr)
	    (klocek ?klocek)
	    (puste ?poz)
	    (pozycja ?klocek ?poz)
	    (obok ?poz1 ?poz2)
	    (poz ?poz1)
	)
	; opuść paczkę na podłogę
	(:action wez
		:parameters (?kolor ?skad ?nr)
		:precondition
		(and
		    (numer ?nr)
		    (kolorx ?kolor)
		    (pomieszczenie ?skad)
		    (kolor ?kolor ?skad ?nr)
		    (ludek ?skad)
		)
		:effect
		(and
			(mam ?kolor ?nr)
			(not (kolor ?kolor ?skad ?nr))
		)
	)
	(:action idz
		:parameters (?gdzie ?skad ?kolor ?nr)
		:precondition
		(and
		    (numer ?nr)
		    (kolorx ?kolor)
		    (pomieszczenie ?gdzie)
		    (pomieszczenie ?skad)
		    (ludek ?skad)
		    (sasiaduje ?skad ?gdzie ?kolor)
		    (not (= ?skad ?gdzie))
		    (mam ?kolor ?nr)
		    (not (exists (?x ?y) (kolor ?x ?skad ?y)))
		)
		:effect
		(and
			(not (mam ?kolor ?nr))
			(not (ludek ?skad))
			(ludek ?gdzie)
		)
	)
	(:action przesun
		:parameters (?klocek ?skad ?gdzie)
		:precondition
		(and
		    (ludek a)
		    (klocek ?klocek)
		    (poz ?skad)
		    (poz ?gdzie)
		    (not (= ?skad ?gdzie))
		    (puste ?gdzie)
		    (obok ?skad ?gdzie)
		    (pozycja ?klocek ?skad)
		)
		:effect
		(and
		    (pozycja ?klocek ?gdzie)
			(not (pozycja ?klocek ?skad))
			(not (puste ?gdzie))
			(puste ?skad)
		)
	)
)

; problem
(define (problem gsoko1a)
(:domain mary)
(:objects a b c d e f g h i zielony czerwony pomaranczowy rozowy niebieski x1 x2 x3 x4 x5 x6 x7 x8 x9 x10 x11 x12 x13 x14 klocek1 klocek2 klocek3 klocek4 klocek5 klocek6 klocek7 klocek8 poz1 poz2 poz3 poz4 poz5 poz6 poz7 poz8 poz9)
(:init
        (numer x1)
        (numer x2)
        (numer x3)
        (numer x4)
        (numer x5)
        (numer x6)
        (numer x7)
        (numer x8)
        (numer x9)
        (numer x10)
        (numer x11)
        (numer x12)
        (numer x13)
        (numer x14)
        (kolorx zielony)
        (kolorx niebieski)
        (kolorx pomaranczowy)
        (kolorx rozowy)
        (kolorx czerwony)
        (pomieszczenie a)
        (pomieszczenie b)
        (pomieszczenie c)
        (pomieszczenie d)
        (pomieszczenie e)
        (pomieszczenie f)
        (pomieszczenie g)
        (pomieszczenie h)
        (pomieszczenie i)
        (ludek f)
        (kolor zielony a x1)
        (kolor zielony d x2)
        (kolor zielony e x3)
        (kolor zielony h x4)
        (kolor czerwony d x5)
        (kolor czerwony h x6)
        (kolor pomaranczowy c x7)
        (kolor pomaranczowy i x8)
        (kolor rozowy b x9)
        (kolor niebieski c x10)
        (kolor niebieski e x11)
        (kolor niebieski f x12)
        (kolor niebieski f x13)
        (kolor niebieski i x14) 
        (sasiaduje a b pomaranczowy)
        (sasiaduje b d pomaranczowy)
        (sasiaduje f g rozowy)
        (sasiaduje h i niebieski)
        (sasiaduje i h niebieski)
        (sasiaduje f i niebieski)
        (sasiaduje i f niebieski)
        (sasiaduje a c czerwony)
        (sasiaduje c a czerwony)
        (sasiaduje e h czerwony)
        (sasiaduje h e czerwony)
        (sasiaduje c e zielony)
        (sasiaduje e c zielony)
        (sasiaduje d f zielony)
        (sasiaduje f d zielony)
        (sasiaduje e f niebieski)
        (sasiaduje f e niebieski)
        (klocek klocek1)
        (klocek klocek2)
        (klocek klocek3)
        (klocek klocek4)
        (klocek klocek5)
        (klocek klocek6)
        (klocek klocek7)
        (klocek klocek8)
        (poz poz1)
        (poz poz2)
        (poz poz3)
        (poz poz4)
        (poz poz5)
        (poz poz6)
        (poz poz7)
        (poz poz8)
        (poz poz9)
        (pozycja klocek5 poz1)
        (pozycja klocek4 poz2)
        (pozycja klocek1 poz3)
        (pozycja klocek8 poz4)
        (pozycja klocek3 poz6)
        (pozycja klocek7 poz7)
        (pozycja klocek2 poz8)
        (pozycja klocek6 poz9)
        (puste poz5)
        (obok poz1 poz2)
        (obok poz1 poz4)
        (obok poz2 poz1)
        (obok poz2 poz3)
        (obok poz2 poz5)
        (obok poz3 poz2)
        (obok poz3 poz6)
        (obok poz4 poz1)
        (obok poz4 poz5)
        (obok poz4 poz7)
        (obok poz5 poz4)
        (obok poz5 poz2)
        (obok poz5 poz6)
        (obok poz5 poz8)
        (obok poz6 poz3)
        (obok poz6 poz9)
        (obok poz6 poz5)
        (obok poz7 poz4)
        (obok poz7 poz8)
        (obok poz8 poz7)
        (obok poz8 poz5)
        (obok poz8 poz9)
        (obok poz9 poz8)
        (obok poz9 poz6)
)
(:goal (and
       (ludek g)
       (pozycja klocek1 poz1)
       (pozycja klocek2 poz2)
       (pozycja klocek3 poz3)
       (pozycja klocek4 poz4)
       (pozycja klocek5 poz5)
       (pozycja klocek6 poz6)
       (pozycja klocek7 poz7)
       (pozycja klocek8 poz8)
))
)

; plan
1. (wez niebieski f x13)
   deleted: (kolor niebieski f x13)
   added: (mam niebieski x13)
   goals met: 1 of 9
2. (wez niebieski f x12)
   deleted: (kolor niebieski f x12)
   added: (mam niebieski x12)
   goals met: 1 of 9
3. (idz e f niebieski x12)
   deleted: (mam niebieski x12) (ludek f)
   added: (ludek e)
   goals met: 1 of 9
4. (wez zielony e x3)
   deleted: (kolor zielony e x3)
   added: (mam zielony x3)
   goals met: 1 of 9
5. (wez niebieski e x11)
   deleted: (kolor niebieski e x11)
   added: (mam niebieski x11)
   goals met: 1 of 9
6. (idz f e niebieski x11)
   deleted: (mam niebieski x11) (ludek e)
   added: (ludek f)
   goals met: 1 of 9
7. (idz d f zielony x3)
   deleted: (mam zielony x3) (ludek f)
   added: (ludek d)
   goals met: 1 of 9
8. (wez zielony d x2)
   deleted: (kolor zielony d x2)
   added: (mam zielony x2)
   goals met: 1 of 9
9. (wez czerwony d x5)
   deleted: (kolor czerwony d x5)
   added: (mam czerwony x5)
   goals met: 1 of 9
10. (idz f d zielony x2)
   deleted: (mam zielony x2) (ludek d)
   added: (ludek f)
   goals met: 1 of 9
11. (idz i f niebieski x13)
   deleted: (mam niebieski x13) (ludek f)
   added: (ludek i)
   goals met: 1 of 9
12. (wez niebieski i x14)
   deleted: (kolor niebieski i x14)
   added: (mam niebieski x14)
   goals met: 1 of 9
13. (wez pomaranczowy i x8)
   deleted: (kolor pomaranczowy i x8)
   added: (mam pomaranczowy x8)
   goals met: 1 of 9
14. (idz h i niebieski x14)
   deleted: (mam niebieski x14) (ludek i)
   added: (ludek h)
   goals met: 1 of 9
15. (wez czerwony h x6)
   deleted: (kolor czerwony h x6)
   added: (mam czerwony x6)
   goals met: 1 of 9
16. (wez zielony h x4)
   deleted: (kolor zielony h x4)
   added: (mam zielony x4)
   goals met: 1 of 9
17. (idz e h czerwony x5)
   deleted: (mam czerwony x5) (ludek h)
   added: (ludek e)
   goals met: 1 of 9
18. (idz c e zielony x4)
   deleted: (mam zielony x4) (ludek e)
   added: (ludek c)
   goals met: 1 of 9
19. (wez niebieski c x10)
   deleted: (kolor niebieski c x10)
   added: (mam niebieski x10)
   goals met: 1 of 9
20. (wez pomaranczowy c x7)
   deleted: (kolor pomaranczowy c x7)
   added: (mam pomaranczowy x7)
   goals met: 1 of 9
21. (idz a c czerwony x6)
   deleted: (mam czerwony x6) (ludek c)
   added: (ludek a)
   goals met: 1 of 9
22. (wez zielony a x1)
   deleted: (kolor zielony a x1)
   added: (mam zielony x1)
   goals met: 1 of 9
23. (przesun klocek8 poz4 poz5)
   deleted: (pozycja klocek8 poz4) (puste poz5)
   added: (pozycja klocek8 poz5) (puste poz4)
   goals met: 1 of 9
24. (przesun klocek5 poz1 poz4)
   deleted: (pozycja klocek5 poz1) (puste poz4)
   added: (pozycja klocek5 poz4) (puste poz1)
   goals met: 1 of 9
25. (przesun klocek4 poz2 poz1)
   deleted: (pozycja klocek4 poz2) (puste poz1)
   added: (pozycja klocek4 poz1) (puste poz2)
   goals met: 1 of 9
26. (przesun klocek8 poz5 poz2)
   deleted: (pozycja klocek8 poz5) (puste poz2)
   added: (pozycja klocek8 poz2) (puste poz5)
   goals met: 1 of 9
27. (przesun klocek5 poz4 poz5)
   deleted: (pozycja klocek5 poz4) (puste poz5)
   added: (pozycja klocek5 poz5) (puste poz4)
   goals met: 2 of 9
28. (przesun klocek4 poz1 poz4)
   deleted: (pozycja klocek4 poz1) (puste poz4)
   added: (pozycja klocek4 poz4) (puste poz1)
   goals met: 3 of 9
29. (przesun klocek8 poz2 poz1)
   deleted: (pozycja klocek8 poz2) (puste poz1)
   added: (pozycja klocek8 poz1) (puste poz2)
   goals met: 3 of 9
30. (przesun klocek1 poz3 poz2)
   deleted: (pozycja klocek1 poz3) (puste poz2)
   added: (pozycja klocek1 poz2) (puste poz3)
   goals met: 3 of 9
31. (przesun klocek3 poz6 poz3)
   deleted: (pozycja klocek3 poz6) (puste poz3)
   added: (pozycja klocek3 poz3) (puste poz6)
   goals met: 4 of 9
32. (przesun klocek5 poz5 poz6)
   deleted: (pozycja klocek5 poz5) (puste poz6)
   added: (pozycja klocek5 poz6) (puste poz5)
   goals met: 3 of 9
33. (przesun klocek2 poz8 poz5)
   deleted: (pozycja klocek2 poz8) (puste poz5)
   added: (pozycja klocek2 poz5) (puste poz8)
   goals met: 3 of 9
34. (przesun klocek7 poz7 poz8)
   deleted: (pozycja klocek7 poz7) (puste poz8)
   added: (pozycja klocek7 poz8) (puste poz7)
   goals met: 2 of 9
35. (przesun klocek4 poz4 poz7)
   deleted: (pozycja klocek4 poz4) (puste poz7)
   added: (pozycja klocek4 poz7) (puste poz4)
   goals met: 1 of 9
36. (przesun klocek8 poz1 poz4)
   deleted: (pozycja klocek8 poz1) (puste poz4)
   added: (pozycja klocek8 poz4) (puste poz1)
   goals met: 1 of 9
37. (przesun klocek1 poz2 poz1)
   deleted: (pozycja klocek1 poz2) (puste poz1)
   added: (pozycja klocek1 poz1) (puste poz2)
   goals met: 2 of 9
38. (przesun klocek2 poz5 poz2)
   deleted: (pozycja klocek2 poz5) (puste poz2)
   added: (pozycja klocek2 poz2) (puste poz5)
   goals met: 3 of 9
39. (przesun klocek8 poz4 poz5)
   deleted: (pozycja klocek8 poz4) (puste poz5)
   added: (pozycja klocek8 poz5) (puste poz4)
   goals met: 3 of 9
40. (przesun klocek4 poz7 poz4)
   deleted: (pozycja klocek4 poz7) (puste poz4)
   added: (pozycja klocek4 poz4) (puste poz7)
   goals met: 4 of 9
41. (przesun klocek7 poz8 poz7)
   deleted: (pozycja klocek7 poz8) (puste poz7)
   added: (pozycja klocek7 poz7) (puste poz8)
   goals met: 5 of 9
42. (przesun klocek8 poz5 poz8)
   deleted: (pozycja klocek8 poz5) (puste poz8)
   added: (pozycja klocek8 poz8) (puste poz5)
   goals met: 6 of 9
43. (przesun klocek5 poz6 poz5)
   deleted: (pozycja klocek5 poz6) (puste poz5)
   added: (pozycja klocek5 poz5) (puste poz6)
   goals met: 7 of 9
44. (przesun klocek6 poz9 poz6)
   deleted: (pozycja klocek6 poz9) (puste poz6)
   added: (pozycja klocek6 poz6) (puste poz9)
   goals met: 8 of 9
45. (idz b a pomaranczowy x7)
   deleted: (mam pomaranczowy x7) (ludek a)
   added: (ludek b)
   goals met: 8 of 9
46. (wez rozowy b x9)
   deleted: (kolor rozowy b x9)
   added: (mam rozowy x9)
   goals met: 8 of 9
47. (idz d b pomaranczowy x8)
   deleted: (mam pomaranczowy x8) (ludek b)
   added: (ludek d)
   goals met: 8 of 9
48. (idz f d zielony x1)
   deleted: (mam zielony x1) (ludek d)
   added: (ludek f)
   goals met: 8 of 9
49. (idz g f rozowy x9)
   deleted: (mam rozowy x9) (ludek f)
   added: (ludek g)
   goals met: 9 of 9
